# Purpose

This notebook demonstrates how to accomplish common data manipulation tasks using both SQL and pandas in Python. Since pandas is often described as "SQL for Python," many operations can be performed with either tool. This comparison is especially useful for interview preparation, as platforms like LeetCode frequently allow toggling between pandas and SQL solutions for the same problem.

By exploring both approaches side-by-side, you'll gain a deeper understanding of how these tools work and develop proficiency with both methods. Happy learning!

The data for this notebook was taken from [Bike Store Relational Database | SQL](https://www.kaggle.com/datasets/dillonmyrick/bike-store-sample-database?select=customers.csv) on [Kaggle](https://www.kaggle.com).

# Libraries

In [1]:
# Insert python libraries
import pandas as pd
import duckdb

# Loading data into dataframe

In [2]:
customers = pd.read_csv("customers.csv")
orders = pd.read_csv("orders.csv")

# Create SQL function

In [3]:
# This makes it so the SQL cells look cleaner
def SQL(query: str):
    display(duckdb.sql(query).df())

# Head of data

In [4]:
# Pandas for customers
customers.head()

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,Debra,Burks,NaN,debra.burks@yahoo.com,9273 Thorne Ave.,Orchard Park,NY,14127
1,2,Kasha,Todd,NaN,kasha.todd@yahoo.com,910 Vine Street,Campbell,CA,95008
2,3,Tameka,Fisher,NaN,tameka.fisher@aol.com,769C Honey Creek St.,Redondo Beach,CA,90278
3,4,Daryl,Spence,NaN,daryl.spence@aol.com,988 Pearl Lane,Uniondale,NY,11553
4,5,Charolette,Rice,(916) 381-6003,charolette.rice@msn.com,107 River Dr.,Sacramento,CA,95820

In [5]:
# Pandas for orders
orders.head()

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6

In [6]:
# SQL for customers
SQL("""

SELECT *
FROM customers
LIMIT 5;

""")

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,Debra,Burks,None,debra.burks@yahoo.com,9273 Thorne Ave.,Orchard Park,NY,14127
1,2,Kasha,Todd,None,kasha.todd@yahoo.com,910 Vine Street,Campbell,CA,95008
2,3,Tameka,Fisher,None,tameka.fisher@aol.com,769C Honey Creek St.,Redondo Beach,CA,90278
3,4,Daryl,Spence,None,daryl.spence@aol.com,988 Pearl Lane,Uniondale,NY,11553
4,5,Charolette,Rice,(916) 381-6003,charolette.rice@msn.com,107 River Dr.,Sacramento,CA,95820

In [7]:
# SQL for orders
SQL("""

SELECT *
FROM orders
LIMIT 5;

""")

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6